Revit 2027 API
Gradient.GradientNoiseLevels Property
 The property labeled "Levels" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GradientNoiseLevels { get; }
Public Shared ReadOnly Property GradientNoiseLevels As String
	Get
public:
static property String^ GradientNoiseLevels {
	String^ get ();
}
static member GradientNoiseLevels : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "1, 10".
See Also
Reference
Gradient Class
Autodesk.Revit.DB.Visual Namespace